In [1]:
import pandas as pd
import datetime 
import psycopg2
from sqlalchemy import create_engine
from time import time
import pandas as pd
import json
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
connect = r"postgresql://{user}:{passw}@panamera-ods.cnsuxis6zqxr.us-west-2.redshift.amazonaws.com:5439/panameraods"
connection_string = connect.format(user='lucasdresl' , passw='cQsY801a76x82x62aWDT')

# Android

## Cars: browse_subcategory_select to not found nothing by usings filter of price

In [ ]:
query = """
WITH step1 as (
  SELECT t.date_event_nk,t.session_long,t.session_long_seq,t.time_event_utc,country_sk 
          FROM ods.panameraolx_mea_hydra_ninja_android_last_month t
      WHERE t.trackevent='browse_subcategory_select' and category_sk = 'olx|mea|pk|5|84' and country_sk = 'olx|mea|pk'
      )
      
SELECT date_event_nk, COUNT(distinct session_long) FROM step1
        GROUP BY 1
        ORDER BY 1
"""

In [ ]:
step1 = pd.read_sql_query(query.replace('%', '%%'), connection_string)

In [ ]:
step1.head()

In [ ]:
query = """
WITH step1 as (
  SELECT t.date_event_nk,t.session_long,t.session_long_seq,t.time_event_utc,country_sk 
          FROM ods.panameraolx_mea_hydra_ninja_android_last_month t
      WHERE t.trackevent='browse_subcategory_select' and category_sk = 'olx|mea|pk|5|84' and country_sk = 'olx|mea|pk'

          ),
    step2 as (
    
    SELECT a.date_event_nk,
           a.session_long,
           a.time_event_utc as tiime_step2 ,
           b.time_event_utc as tiime_step1
                FROM ods.panameraolx_mea_hydra_ninja_android_last_month a
                    INNER JOIN step1 b ON a.session_long=b.session_long AND a.date_event_nk=b.date_event_nk
                                                                        --AND a.session_long_seq=b.session_long_seq
                    WHERE a.trackevent='listings_results'
                        AND result_count = 0 and category_sk = 'olx|mea|pk|5|84'
                        and a.country_sk = 'olx|mea|pk'
                    AND DATEDIFF(minute, tiime_step2 , tiime_step1) < 10
             
    )
SELECT date_event_nk,COUNT(distinct session_long) FROM step2
        GROUP BY 1
        ORDER BY 1
        
"""

In [ ]:
step2 = pd.read_sql_query(query.replace('%', '%%'), connection_string)

In [ ]:
funnel = pd.merge(step1,step2,how='left',on=['date_event_nk'] , validate = 'one_to_one')
funnel['Show_Complete'] = funnel['count_y'] / funnel['count_x']
funnel.drop(funnel.index[-1:], inplace=True)
funnel.head()

In [ ]:
print(funnel['count_y'].sum() / funnel['count_x'].sum())

## PWA

In [71]:
# People which make login_show
query = """
WITH step1 as (
  SELECT t.date_event_nk,t.session_long,t.session_long_seq,t.time_event_utc FROM ods.panameraolx_mea_hydra_ninja_web_last_month t
      WHERE t.trackevent = 'browse_subcategory_select' AND country_sk = 'olx|mea|pk' and split_part(category_sk , '|',4) = 5
          )
SELECT date_event_nk, COUNT(distinct session_long) FROM step1
        GROUP BY 1
        ORDER BY 1
"""

In [72]:
step1 = pd.read_sql_query(query.replace('%', '%%'), connection_string)

In [73]:
step1.head()

  date_event_nk  count
0    2018-12-01   1613
1    2018-12-02   1267
2    2018-12-03   2280
3    2018-12-04   2343
4    2018-12-05   2132

In [74]:
# People which make login_sign_in_start
query = """
WITH step1 as (

  SELECT t.date_event_nk,t.session_long,t.session_long_seq,t.time_event_utc 
          FROM ods.panameraolx_mea_hydra_ninja_web_last_month t
      WHERE t.trackevent = 'browse_subcategory_select' AND country_sk = 'olx|mea|pk' and split_part(category_sk , '|',4) = 5
      
          ),
    step2 as (
    SELECT a.date_event_nk,
           a.session_long,
           a.time_event_utc as tiime_step2 ,
           b.time_event_utc as tiime_step1
                FROM ods.panameraolx_mea_hydra_ninja_web_last_month a
                    INNER JOIN step1 b ON a.session_long=b.session_long AND a.date_event_nk=b.date_event_nk
                                                                        --AND a.session_long_seq=b.session_long_seq
                    WHERE a.trackevent='listing_tap_apply_filters'
                    AND filters = '%%year%%' AND filters = '%%price%%'
                    AND DATEDIFF(minute, tiime_step1 , tiime_step2) < 10 -- tiempo1 - tiempo2
                    AND DATEDIFF(minute, tiime_step1 , tiime_step2) >= 0 -- tiempo1 - tiempo2
                    AND country_sk = 'olx|mea|pk'
    )
SELECT date_event_nk, COUNT(distinct session_long) FROM step2
        GROUP BY 1
        ORDER BY 1
"""

In [75]:
step2 = pd.read_sql_query(query.replace('%', '%%'), connection_string)

In [76]:
step2.head()

Empty DataFrame
Columns: [date_event_nk, count]
Index: []

In [77]:
query = """
WITH step1 as (

  SELECT t.date_event_nk,t.session_long,t.session_long_seq,t.time_event_utc 
          FROM ods.panameraolx_mea_hydra_ninja_web_last_month t
      WHERE t.trackevent = 'browse_subcategory_select' AND country_sk = 'olx|mea|pk' and split_part(category_sk , '|',4) = 5
      
          ),
    step2 as (
    SELECT a.date_event_nk,
           a.session_long,
           a.time_event_utc as tiime_step2 ,
           b.time_event_utc as tiime_step1
                FROM ods.panameraolx_mea_hydra_ninja_web_last_month a
                    INNER JOIN step1 b ON a.session_long=b.session_long AND a.date_event_nk=b.date_event_nk
                                                                        --AND a.session_long_seq=b.session_long_seq
                    WHERE a.trackevent='listing_tap_apply_filters'
                    AND filters = '%%year%%' AND filters = '%%price%%' 
                    AND DATEDIFF(minute, tiime_step1 , tiime_step2) < 10 -- tiempo1 - tiempo2
                    AND DATEDIFF(minute, tiime_step1 , tiime_step2) >= 0 -- tiempo1 - tiempo2
                    AND country_sk = 'olx|mea|pk'
    ),
    step3 as (
    SELECT a.date_event_nk,
           a.session_long,
           a.time_event_utc as tiime_step3,
           b.tiime_step2
                FROM ods.panameraolx_mea_hydra_ninja_web_last_month a
                    INNER JOIN step2 b ON a.session_long=b.session_long AND a.date_event_nk=b.date_event_nk
                   
                    WHERE a.trackevent='view_item'                                                   
                    AND DATEDIFF(minute, tiime_step2 , tiime_step3) <  10
                    --AND DATEDIFF(minute, tiime_step2 , tiime_step3) >= 0 -- tiempo1 - tiempo2
                    AND country_sk = 'olx|mea|pk'

    )
SELECT date_event_nk, COUNT(distinct session_long) FROM step3
    GROUP BY 1
    ORDER BY 1
"""

In [68]:
step3 = pd.read_sql_query(query.replace('%', '%%'), connection_string)

In [69]:
step3.head()

Empty DataFrame
Columns: [date_event_nk, count]
Index: []

In [70]:
funnel = pd.merge(step1,step2,how='left',on=['date_event_nk'])
funnel = pd.merge(funnel,step3,how='left',on=['date_event_nk'])
funnel['Show_Start'] = funnel['count_y'] / funnel['count_x']
funnel['Start_Complete'] = funnel['count'] / funnel['count_y']
funnel['Show_Complete'] = funnel['count'] / funnel['count_x']
#funnel.drop(funnel.index[-1:], inplace=True)
funnel.head(20)

,date_event_nk,count_x,count_y,count,Show_Start,Start_Complete,Show_Complete
0,2018-12-01,1613,NaN,NaN,NaN,NaN,NaN
1,2018-12-02,1267,NaN,NaN,NaN,NaN,NaN
2,2018-12-03,2280,NaN,NaN,NaN,NaN,NaN
3,2018-12-04,2343,NaN,NaN,NaN,NaN,NaN
4,2018-12-05,2132,NaN,NaN,NaN,NaN,NaN
5,2018-12-06,2190,NaN,NaN,NaN,NaN,NaN
6,2018-12-07,2087,NaN,NaN,NaN,NaN,NaN
7,2018-12-08,1842,NaN,NaN,NaN,NaN,NaN
8,2018-12-09,1380,NaN,NaN,NaN,NaN,NaN
9,2018-12-10,2379,NaN,NaN,NaN,NaN,NaN
10,2018-12-11,2437,NaN,NaN,NaN,NaN,NaN
11,2018-12-12,2339,NaN,NaN,NaN,NaN,NaN
12,2018-12-13,2247,NaN,NaN,NaN,NaN,NaN
13,2018-12-14,2024,NaN,NaN,NaN,NaN,NaN
14,2018-12-15,1818,NaN,NaN,NaN,NaN,NaN
15,2018-12-16,1263,NaN,NaN,NaN,NaN,NaN
16,2018-12-17,2267,NaN,NaN,NaN,NaN,NaN
17,2018-12-18,2303,NaN,NaN,NaN,NaN,NaN
18,2018-12-19,2377,NaN,NaN,NaN,NaN,NaN
19,2018-12-20,2267,NaN,NaN,NaN,NaN,NaN

### With no results

In [25]:
# People which make login_show
query = """
WITH step1 as (
  SELECT t.date_event_nk,t.session_long,t.session_long_seq,t.time_event_utc FROM ods.panameraolx_mea_hydra_ninja_web_last_month t
      WHERE t.trackevent = 'browse_subcategory_select' AND country_sk = 'olx|mea|pk' and split_part(category_sk , '|',4) = 5
          )
SELECT date_event_nk, COUNT(distinct session_long) FROM step1
        GROUP BY 1
        ORDER BY 1
"""

In [26]:
step1 = pd.read_sql_query(query.replace('%', '%%'), connection_string)

In [27]:
step1.head()

  date_event_nk  count
0    2018-12-01   1613
1    2018-12-02   1267
2    2018-12-03   2280
3    2018-12-04   2343
4    2018-12-05   2132

In [44]:
# People which make login_sign_in_start
query = """
WITH step1 as (

  SELECT t.date_event_nk,t.session_long,t.session_long_seq,t.time_event_utc 
          FROM ods.panameraolx_mea_hydra_ninja_web_last_month t
      WHERE t.trackevent = 'browse_subcategory_select' AND country_sk = 'olx|mea|pk' and split_part(category_sk , '|',4) = 5
      
          ),
    step2 as (
    SELECT a.date_event_nk,
           a.session_long,
           a.time_event_utc as tiime_step2 ,
           b.time_event_utc as tiime_step1
                FROM ods.panameraolx_mea_hydra_ninja_web_last_month a
                    INNER JOIN step1 b ON a.session_long=b.session_long AND a.date_event_nk=b.date_event_nk
                                                                        --AND a.session_long_seq=b.session_long_seq
                    WHERE a.trackevent='listing_tap_apply_filters'
                    AND filters like '%%price%%'
                    AND DATEDIFF(minute, tiime_step1 , tiime_step2) < 10 -- tiempo1 - tiempo2
                    AND DATEDIFF(minute, tiime_step1 , tiime_step2) >= 0 -- tiempo1 - tiempo2
                    AND country_sk = 'olx|mea|pk'
    )
SELECT date_event_nk, COUNT(distinct session_long) FROM step2
        GROUP BY 1
        ORDER BY 1
"""

In [45]:
step2 = pd.read_sql_query(query.replace('%', '%%'), connection_string)

In [46]:
step2.head()

  date_event_nk  count
0    2018-12-01    274
1    2018-12-02    182
2    2018-12-03    343
3    2018-12-04    369
4    2018-12-05    302

In [47]:
# People which make login_sign_in_start
query = """
WITH step1 as (

  SELECT t.date_event_nk,t.session_long,t.session_long_seq,t.time_event_utc 
          FROM ods.panameraolx_mea_hydra_ninja_web_last_month t
      WHERE t.trackevent = 'browse_subcategory_select' AND country_sk = 'olx|mea|pk' and split_part(category_sk , '|',4) = 5
      
          ),
    step2 as (
    SELECT a.date_event_nk,
           a.session_long,
           a.time_event_utc as tiime_step2 ,
           b.time_event_utc as tiime_step1
                FROM ods.panameraolx_mea_hydra_ninja_web_last_month a
                    INNER JOIN step1 b ON a.session_long=b.session_long AND a.date_event_nk=b.date_event_nk
                                                                        --AND a.session_long_seq=b.session_long_seq
                    WHERE a.trackevent='listing_tap_apply_filters'
                    AND filters like '%%price%%'
                    AND DATEDIFF(minute, tiime_step1 , tiime_step2) < 10 -- tiempo1 - tiempo2
                    AND DATEDIFF(minute, tiime_step1 , tiime_step2) >= 0 -- tiempo1 - tiempo2
                    AND country_sk = 'olx|mea|pk'
    ),
    step3 as (
    SELECT a.date_event_nk,
           a.session_long,
           a.time_event_utc as tiime_step3,
           b.tiime_step2
                FROM ods.panameraolx_mea_hydra_ninja_web_last_month a
                    INNER JOIN step2 b ON a.session_long=b.session_long AND a.date_event_nk=b.date_event_nk
                     WHERE a.trackevent='page_error_404'                                                   
                    AND DATEDIFF(minute, tiime_step1 , tiime_step2) < 5
                    AND DATEDIFF(minute, tiime_step1 , tiime_step2) > 0 -- tiempo1 - tiempo2
                    AND country_sk = 'olx|mea|pk'

    )
SELECT date_event_nk, COUNT(distinct session_long) FROM step3
    GROUP BY 1
    ORDER BY 1
"""

In [48]:
step3 = pd.read_sql_query(query.replace('%', '%%'), connection_string)

In [49]:
step3.head()

  date_event_nk  count
0    2018-12-01     43
1    2018-12-02     47
2    2018-12-03     69
3    2018-12-04     61
4    2018-12-05     56

In [50]:
funnel = pd.merge(step1,step2,how='left',on=['date_event_nk'])
funnel = pd.merge(funnel,step3,how='left',on=['date_event_nk'])
funnel['Show_Start'] = funnel['count_y'] / funnel['count_x']
funnel['Start_Complete'] = funnel['count'] / funnel['count_y']
funnel['Show_Complete'] = funnel['count'] / funnel['count_x']
#funnel.drop(funnel.index[-1:], inplace=True)
funnel.head(20)

,date_event_nk,count_x,count_y,count,Show_Start,Start_Complete,Show_Complete
0,2018-12-01,1613,274,43,0.169870,0.156934,0.026658
1,2018-12-02,1267,182,47,0.143646,0.258242,0.037096
2,2018-12-03,2280,343,69,0.150439,0.201166,0.030263
3,2018-12-04,2343,369,61,0.157490,0.165312,0.026035
4,2018-12-05,2132,302,56,0.141651,0.185430,0.026266
5,2018-12-06,2190,326,64,0.148858,0.196319,0.029224
6,2018-12-07,2087,323,76,0.154768,0.235294,0.036416
7,2018-12-08,1842,293,57,0.159066,0.194539,0.030945
8,2018-12-09,1380,216,44,0.156522,0.203704,0.031884
9,2018-12-10,2379,360,73,0.151324,0.202778,0.030685
10,2018-12-11,2437,399,99,0.163726,0.248120,0.040624
11,2018-12-12,2339,374,62,0.159897,0.165775,0.026507
12,2018-12-13,2247,350,56,0.155763,0.160000,0.024922
13,2018-12-14,2024,301,44,0.148715,0.146179,0.021739
14,2018-12-15,1818,287,49,0.157866,0.170732,0.026953
15,2018-12-16,1263,167,35,0.132225,0.209581,0.027712
16,2018-12-17,2267,376,74,0.165858,0.196809,0.032642
17,2018-12-18,2303,356,46,0.154581,0.129213,0.019974
18,2018-12-19,2377,378,62,0.159024,0.164021,0.026083
19,2018-12-20,2267,375,63,0.165417,0.168000,0.027790